Revit 2027 API
DefaultDivideSettings.SetSurfaceDistance Method
 Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSurfaceDistance(
	UVGridlineType gridlines,
	double distance
)
Public Sub SetSurfaceDistance (
	gridlines As UVGridlineType,
	distance As Double
)
public:
void SetSurfaceDistance(
	UVGridlineType gridlines,
	double distance
)
member SetSurfaceDistance :
        gridlines : UVGridlineType *
        distance : float -> unit
Parameters
gridlines UVGridlineType
 U-gridlines or V-gridlines.
distance Double
 A default distance for a layout.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for distance must be positive. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace